Examinator/src/Enums/ТипыАвтоматическихРассылокСУО/ТипыАвтоматическихРассылокСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыАвтоматическихРассылокСУО</name>
  <enumValues>
    <name>ПриЗачисленииНаМероприятие</name>
  </enumValues>
  <enumValues>
    <name>ПриЗачисленииНаПрограммуОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПриНачалеПрохожденияМероприятия</name>
  </enumValues>
  <enumValues>
    <name>ПриНачалеПрохожденияПрограммыОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПослеПрохожденияМероприятия</name>
  </enumValues>
  <enumValues>
    <name>ПослеПрохожденияПрограммыОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПриглашениеНаОткрытоеМероприятие</name>
  </enumValues>
  <enumValues>
    <name>ПриглашениеНаОткрытуюПрограммуОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПриНазначенииПреподавателяНаМероприятие</name>
  </enumValues>
  <enumValues>
    <name>КонтрольНепрочитанныхЛичныхСообщений</name>
  </enumValues>
  <enumValues>
    <name>КонтрольНепрочитанныхТемФорума</name>
  </enumValues>
  <enumValues>
    <name>ПриОтправкеЗаданияНаПроверку</name>
  </enumValues>
  <enumValues>
    <name>ВажнаяНовость</name>
  </enumValues>
  <enumValues>
    <name>ВосстановлениеПароля</name>
  </enumValues>
  <enumValues>
    <name>РегистрацияНовогоПользователя</name>
  </enumValues>
  <enumValues>
    <name>ПередОкончаниемДоступаКБазе</name>
  </enumValues>
  <enumValues>
    <name>ПриОбновленииОтбораПользователей</name>
  </enumValues>
  <enumValues>
    <name>ПослеПроверкиЗаданияПреподавателем</name>
  </enumValues>
  <enumValues>
    <name>ПослеВозвратаНаДоработкуЗадания</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыАвтоматическихРассылокСУО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	НовыйСписокВыбора = СписокВыбора();
	
	Если НовыйСписокВыбора <> Неопределено Тогда		
		СтандартнаяОбработка = Ложь;		
		ДанныеВыбора = НовыйСписокВыбора;		
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция СписокВыбора() Экспорт
	
	ЭтоПолныйИнтерфейс = ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО");
	ЭтоОбразовательнаяОрганизация = ПолучитьФункциональнуюОпцию("ОбразовательнаяОрганизацияОО");
	РасширеннаяФункциональность = ПолучитьФункциональнуюОпцию("РасширеннаяФункциональностьСУО");
	ИспользуетсяВебКабинет = ПолучитьФункциональнуюОпцию("ИспользоватьВебКабинетСУ");
	ИспользуютсяСлушатели = ПолучитьФункциональнуюОпцию("ИспользоватьСлушателейСУО");
	
	ДанныеВыбора = Неопределено;
	
	Если НЕ РасширеннаяФункциональность Тогда
		
		ДанныеВыбора = Новый СписокЗначений;
		
		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ТипыАвтоматическихРассылокСУО.ПриЗачисленииНаМероприятие;
		Элемент.Представление = Перечисления.ТипыАвтоматическихРассылокСУО.ПриЗачисленииНаМероприятие;
		
		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПрохожденияМероприятия;
		Элемент.Представление = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПрохожденияМероприятия;		
		
		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ТипыАвтоматическихРассылокСУО.ВажнаяНовость;
		Элемент.Представление = Перечисления.ТипыАвтоматическихРассылокСУО.ВажнаяНовость;		
		
		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ТипыАвтоматическихРассылокСУО.ПриНазначенииПреподавателяНаМероприятие;
		Элемент.Представление = Перечисления.ТипыАвтоматическихРассылокСУО.ПриНазначенииПреподавателяНаМероприятие;				
				
		Если ЭтоПолныйИнтерфейс ИЛИ ЭтоОбразовательнаяОрганизация Тогда
		
			Элемент = ДанныеВыбора.Добавить();
			Элемент.Значение = Перечисления.ТипыАвтоматическихРассылокСУО.КонтрольНепрочитанныхЛичныхСообщений;
			Элемент.Представление = Перечисления.ТипыАвтоматическихРассылокСУО.КонтрольНепрочитанныхЛичныхСообщений;
			
			Элемент = ДанныеВыбора.Добавить();
			Элемент.Значение = Перечисления.ТипыАвтоматическихРассылокСУО.КонтрольНепрочитанныхТемФорума;
			Элемент.Представление = Перечисления.ТипыАвтоматическихРассылокСУО.КонтрольНепрочитанныхТемФорума;
			
		КонецЕсли;
		
		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ТипыАвтоматическихРассылокСУО.РегистрацияНовогоПользователя;
		Элемент.Представление = Перечисления.ТипыАвтоматическихРассылокСУО.РегистрацияНовогоПользователя;		
		
		Если ИспользуетсяВебКабинет Тогда
		
			Элемент = ДанныеВыбора.Добавить();
			Элемент.Значение = Перечисления.ТипыАвтоматическихРассылокСУО.ВосстановлениеПароля;
			Элемент.Представление = Перечисления.ТипыАвтоматическихРассылокСУО.ВосстановлениеПароля;
			
		КонецЕсли;
			
		Если ЭтоПолныйИнтерфейс Тогда
			
			Если НЕ ИспользуютсяСлушатели Тогда
			
				Элемент = ДанныеВыбора.Добавить();
				Элемент.Значение = Перечисления.ТипыАвтоматическихРассылокСУО.ПриЗачисленииНаПрограммуОбучения;
				Элемент.Представление = Перечисления.ТипыАвтоматическихРассылокСУО.ПриЗачисленииНаПрограммуОбучения;		
				
				Элемент = ДанныеВыбора.Добавить();
				Элемент.Значение = Перечисления.ТипыАвтоматическихРассылокСУО.ПриглашениеНаОткрытоеМероприятие;
				Элемент.Представление = Перечисления.ТипыАвтоматическихРассылокСУО.ПриглашениеНаОткрытоеМероприятие;					
				
			КонецЕсли;
				
			Элемент = ДанныеВыбора.Добавить();
			Элемент.Значение = Перечисления.ТипыАвтоматическихРассылокСУО.ПередОкончаниемДоступаКБазе;
			Элемент.Представление = Перечисления.ТипыАвтоматическихРассылокСУО.ПередОкончаниемДоступаКБазе;					
			
			Элемент = ДанныеВыбора.Добавить();
			Элемент.Значение = Перечисления.ТипыАвтоматическихРассылокСУО.ПриОтправкеЗаданияНаПроверку;
			Элемент.Представление = Перечисления.ТипыАвтоматическихРассылокСУО.ПриОтправкеЗаданияНаПроверку;					
			
			Элемент = ДанныеВыбора.Добавить();
			Элемент.Значение = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПроверкиЗаданияПреподавателем;
			Элемент.Представление = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПроверкиЗаданияПреподавателем;					
			
			Элемент = ДанныеВыбора.Добавить();
			Элемент.Значение = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеВозвратаНаДоработкуЗадания;
			Элемент.Представление = Перечисления.ТипыАвтоматическихРассылокСУО.ПослеВозвратаНаДоработкуЗадания;					
			
			Элемент = ДанныеВыбора.Добавить();
			Элемент.Значение = Перечисления.ТипыАвтоматическихРассылокСУО.ПриОбновленииОтбораПользователей;
			Элемент.Представление = НСтр("ru = 'Автоматически отобранным адресатам'");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеВыбора;
	
КонецФункции

Процедура ДобавитьТипыПроведенийОбучения(МассивТипов) Экспорт
	
	МассивТипов.Добавить(Перечисления.ТипыАвтоматическихРассылокСУО.ПослеВозвратаНаДоработкуЗадания);
	МассивТипов.Добавить(Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПроверкиЗаданияПреподавателем);
	МассивТипов.Добавить(Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПрохожденияМероприятия);
	МассивТипов.Добавить(Перечисления.ТипыАвтоматическихРассылокСУО.ПриглашениеНаОткрытоеМероприятие);
	МассивТипов.Добавить(Перечисления.ТипыАвтоматическихРассылокСУО.ПриЗачисленииНаМероприятие);
	МассивТипов.Добавить(Перечисления.ТипыАвтоматическихРассылокСУО.ПриНазначенииПреподавателяНаМероприятие);
	МассивТипов.Добавить(Перечисления.ТипыАвтоматическихРассылокСУО.ПриНачалеПрохожденияМероприятия);
	МассивТипов.Добавить(Перечисления.ТипыАвтоматическихРассылокСУО.ПриОтправкеЗаданияНаПроверку);
	
КонецПроцедуры

Процедура ДобавитьТипыПрограммОбучения(МассивТипов) Экспорт
	
	МассивТипов.Добавить(Перечисления.ТипыАвтоматическихРассылокСУО.ПриЗачисленииНаПрограммуОбучения);
	МассивТипов.Добавить(Перечисления.ТипыАвтоматическихРассылокСУО.ПриНачалеПрохожденияПрограммыОбучения);
	МассивТипов.Добавить(Перечисления.ТипыАвтоматическихРассылокСУО.ПослеПрохожденияПрограммыОбучения);
	МассивТипов.Добавить(Перечисления.ТипыАвтоматическихРассылокСУО.ПриглашениеНаОткрытуюПрограммуОбучения);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
